Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.0.20/atdf/ATSAML22N18A.atdf
        <register name="ADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="AMOD" caption="Access Mode" mask="0x3"/>
          <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="LENGTH" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Length">
          <bitfield name="LENGTH" caption="Length" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Data">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCC" offset="0x10" rw="RW" size="4" count="2" initval="0x00000000" caption="Debug Communication Channel n">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DID" offset="0x18" rw="R" size="4" initval="0x10820100" caption="Device Identification">
          <bitfield name="DEVSEL" caption="Device Select" mask="0xFF"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF00"/>
          <bitfield name="DIE" caption="Die Number" mask="0xF000"/>
          <bitfield name="SERIES" caption="Series" mask="0x3F0000" values="DSU_DID__SERIES"/>
          <bitfield name="FAMILY" caption="Family" mask="0xF800000" values="DSU_DID__FAMILY"/>
          <bitfield name="PROCESSOR" caption="Processor" mask="0xF0000000" values="DSU_DID__PROCESSOR"/>
        </register>
        <register name="DCFG" offset="0xF0" rw="RW" size="4" count="2" initval="0x00000000" caption="Device Configuration">
          <bitfield name="DCFG" caption="Device Configuration" mask="0xFFFFFFFF"/>
        </register>
        <register name="ENTRY0" offset="0x1000" rw="R" size="4" initval="0x9F0FC002" caption="CoreSight ROM Table Entry 0">
          <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="ENTRY1" offset="0x1004" rw="R" size="4" initval="0x00007002" caption="CoreSight ROM Table Entry 1">
        </register>
        <register name="END" offset="0x1008" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table End">
          <bitfield name="END" caption="End Marker" mask="0xFFFFFFFF"/>
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Memory Type">
          <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 4">
          <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="FKBC" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PID5" offset="0x1FD4" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 5">
        </register>
        <register name="PID6" offset="0x1FD8" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 6">
        </register>
        <register name="PID7" offset="0x1FDC" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 7">
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="Peripheral Identification 0">
          <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x000000FC" caption="Peripheral Identification 1">
          <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
          <bitfield name="JEPIDCL" caption="Low part of the JEP-106 Identity Code" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x00000009" caption="Peripheral Identification 2">
          <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
          <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 3">
          <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
          <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="Component Identification 0">
          <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="Component Identification 1">
          <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
          <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="Component Identification 2">
          <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="Component Identification 3">
          <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="DSU_DID__FAMILY">
        <value name="0" caption="General purpose microcontroller" value="0"/>
        <value name="1" caption="PicoPower" value="1"/>
      </value-group>
      <value-group name="DSU_DID__PROCESSOR">
        <value name="0" caption="Cortex-M0" value="0"/>
        <value name="1" caption="Cortex-M0+" value="1"/>
        <value name="2" caption="Cortex-M3" value="2"/>
        <value name="3" caption="Cortex-M4" value="3"/>
      </value-group>
      <value-group name="DSU_DID__SERIES">
        <value name="0" caption="Cortex-M0+ processor, basic feature set" value="0"/>
        <value name="1" caption="Cortex-M0+ processor, USB" value="1"/>
      </value-group>
    </module>
    <module name="EIC" id="U2254" version="2.0.2" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CKSEL" caption="Clock Selection" mask="0x10" values="EIC_CTRLA__CKSEL"/>
        </register>
        <register name="NMICTRL" offset="0x1" rw="RW" size="1" initval="0x00" caption="NMI Control">
          <bitfield name="NMISENSE" caption="NMI Input Sense Configuration" mask="0x7" values="EIC_NMICTRL__NMISENSE"/>
          <bitfield name="NMIFILTEN" caption="NMI Filter Enable" mask="0x8"/>
          <bitfield name="NMIASYNCH" caption="NMI Asynchronous edge Detection Enable" mask="0x10" values="EIC_NMICTRL__NMIASYNCH"/>
        </register>
        <register name="NMIFLAG" offset="0x2" rw="RW" size="2" atomic-op="clear:NMIFLAG" initval="0x0000" caption="NMI Interrupt Flag">
          <bitfield name="NMI" caption="NMI Interrupt Flag" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Syncbusy register">
          <bitfield name="SWRST" caption="Software reset synchronisation" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable synchronisation" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EXTINTEO" caption="External Interrupt Event Output Enable" mask="0xFFFF"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT" caption="External Interrupt Disable" mask="0xFFFF"/>
        </register>
