Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.0.20/atdf/ATSAML22N18A.atdf
        <register name="SDATAL2" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Segments Data Low for COM2 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SDATAH2" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="Segments Data High for COM2 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFF"/>
        </register>
        <register name="SDATAL3" offset="0x3C" rw="RW" size="4" initval="0x00000000" caption="Segments Data Low for COM3 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SDATAH3" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Segments Data High for COM3 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFF"/>
        </register>
        <register name="SDATAL4" offset="0x44" rw="RW" size="4" initval="0x00000000" caption="Segments Data Low for COM4 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SDATAH4" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="Segments Data High for COM4 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0x3FF"/>
        </register>
        <register name="SDATAL5" offset="0x4C" rw="RW" size="4" initval="0x00000000" caption="Segments Data Low for COM5 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SDATAH5" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="Segments Data High for COM5 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0x3FF"/>
        </register>
        <register name="SDATAL6" offset="0x54" rw="RW" size="4" initval="0x00000000" caption="Segments Data Low for COM6 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SDATAH6" offset="0x58" rw="RW" size="4" initval="0x00000000" caption="Segments Data High for COM6 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFF"/>
        </register>
        <register name="SDATAL7" offset="0x5C" rw="RW" size="4" initval="0x00000000" caption="Segments Data Low for COM7 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SDATAH7" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="Segments Data High for COM7 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFF"/>
        </register>
        <register name="ISDATA" offset="0x64" rw="W" size="4" initval="0x00000000" caption="Indirect Segments Data Access">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFF"/>
          <bitfield name="SDMASK" caption="Segments Data Mask" mask="0xFF00"/>
          <bitfield name="OFF" caption="Byte Offset" mask="0x3F0000"/>
        </register>
        <register name="BCFG" offset="0x68" rw="RW" size="4" initval="0x00000000" caption="Blink Configuration">
          <bitfield name="MODE" caption="Blinking Mode" mask="0x1" values="SLCD_BCFG__MODE"/>
          <bitfield name="FCS" caption="Frame Counter Selection" mask="0x6" values="SLCD_BCFG__FCS"/>
          <bitfield name="BSS0" caption="Blink Segment Selection 0" mask="0xFF00"/>
          <bitfield name="BSS1" caption="Blink Segment Selection 1" mask="0xFF0000"/>
        </register>
        <register name="CSRCFG" offset="0x6C" rw="RW" size="4" initval="0x00000000" caption="Circular Shift Register Configuration">
          <bitfield name="DIR" caption="Direction" mask="0x1"/>
          <bitfield name="FCS" caption="Frame Counter Selection" mask="0x6" values="SLCD_CSRCFG__FCS"/>
          <bitfield name="SIZE" caption="Circular Shift Register Size" mask="0xF0"/>
          <bitfield name="DATA" caption="Circular Shift Register Value" mask="0xFFFF00"/>
        </register>
        <register name="CMCFG" offset="0x70" rw="RW" size="1" initval="0x00" caption="Character Mapping Configuration">
          <bitfield name="NSEG" caption="Number of SEG lines" mask="0x7"/>
          <bitfield name="DEC" caption="Decrement SEG Line Index" mask="0x8"/>
        </register>
        <register name="ACMCFG" offset="0x74" rw="RW" size="4" initval="0x00000000" caption="Automated Character Mapping Configuration">
          <bitfield name="NCOM" caption="COM Lines per Row" mask="0x7"/>
          <bitfield name="NDIG" caption="Number of Digit" mask="0xF0"/>
          <bitfield name="STEPS" caption="Scrolling Steps" mask="0xFF00"/>
          <bitfield name="NDROW" caption="Number of Digit per Row" mask="0x3F0000"/>
          <bitfield name="MODE" caption="Mode" mask="0x800000" values="SLCD_ACMCFG__MODE"/>
          <bitfield name="STSEG" caption="Start SEG Line" mask="0x3F000000"/>
          <bitfield name="FCS" caption="Frame Counter Selection" mask="0xC0000000" values="SLCD_ACMCFG__FCS"/>
        </register>
        <register name="ABMCFG" offset="0x78" rw="RW" size="1" initval="0x00" caption="Automated Bit Mapping Configuration">
          <bitfield name="FCS" caption="Frame Counter Selection" mask="0x3" values="SLCD_ABMCFG__FCS"/>
          <bitfield name="SIZE" caption="Size" mask="0xFC"/>
        </register>
        <register name="CMDATA" offset="0x7C" rw="W" size="4" initval="0x00000000" caption="Character Mapping Segments Data">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFFFFF"/>
        </register>
        <register name="CMDMASK" offset="0x80" rw="RW" size="4" initval="0x0000" caption="Character Mapping Segments Data Mask">
          <bitfield name="SDMASK" caption="Segments Data Mask" mask="0xFFFFFF"/>
        </register>
        <register name="CMINDEX" offset="0x84" rw="RW" size="2" initval="0x0000" caption="Character Mapping SEG/COM Index">
          <bitfield name="SINDEX" caption="SEG Line Index" mask="0x3F"/>
          <bitfield name="CINDEX" caption="COM Line Index" mask="0x700"/>
        </register>
      </register-group>
      <value-group name="SLCD_CTRLA__BIAS">
        <value name="HALF" caption="1/2 bias" value="1"/>
        <value name="THIRD" caption="1/3 bias" value="2"/>
        <value name="FOURTH" caption="1/4 bias" value="3"/>
      </value-group>
