Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.0.20/atdf/ATSAML22N18A.atdf
      <value-group name="SLCD_CTRLA__DMFCS">
        <value name="FC0" caption="Frame Counter 0" value="0"/>
        <value name="FC1" caption="Frame Counter 1" value="1"/>
        <value name="FC2" caption="Frame Counter 2" value="2"/>
        <value name="NFC" caption="Frame Counter event to DMU is forced to 0" value="3"/>
      </value-group>
      <value-group name="SLCD_CTRLA__DUTY">
        <value name="HALF" caption="1/2 duty" value="1"/>
        <value name="THIRD" caption="1/3 duty" value="2"/>
        <value name="FOURTH" caption="1/4 duty" value="3"/>
        <value name="SIXTH" caption="1/6 duty" value="4"/>
        <value name="EIGHT" caption="1/8 duty" value="5"/>
      </value-group>
      <value-group name="SLCD_CTRLA__PRESC">
        <value name="PRESC16" caption="16" value="0"/>
        <value name="PRESC32" caption="32" value="1"/>
        <value name="PRESC64" caption="64" value="2"/>
        <value name="PRESC128" caption="128" value="3"/>
      </value-group>
      <value-group name="SLCD_CTRLA__PRF">
        <value name="PR2000" caption="2kHz" value="0"/>
        <value name="PR1000" caption="1kHz" value="1"/>
        <value name="PR500" caption="500Hz" value="2"/>
        <value name="PR250" caption="250Hz" value="3"/>
      </value-group>
      <value-group name="SLCD_CTRLA__RRF">
        <value name="RR2000" caption="2kHz" value="0"/>
        <value name="RR1000" caption="1kHz" value="1"/>
        <value name="RR500" caption="500Hz" value="2"/>
        <value name="RR250" caption="250Hz" value="3"/>
        <value name="RR125" caption="125Hz" value="4"/>
        <value name="RR62" caption="62.5Hz" value="5"/>
      </value-group>
      <value-group name="SLCD_CTRLA__WMOD">
        <value name="LP" caption="Low Power Waveform Mode" value="0"/>
        <value name="STD" caption="Standard Waveform Mode" value="1"/>
      </value-group>
      <value-group name="SLCD_CTRLC__LPPM">
        <value name="AUTO" caption="LCD power automatically select regualation mode or pump mode" value="0"/>
        <value name="STEPUP" caption="LCD power use step-up pump loop only" value="1"/>
        <value name="STEPDOWN" caption="LCD power use step-down drop-out regulation loop only" value="2"/>
      </value-group>
      <value-group name="SLCD_BCFG__FCS">
        <value name="FC0" caption="Frame Counter 0" value="0"/>
        <value name="FC1" caption="Frame Counter 1" value="1"/>
        <value name="FC2" caption="Frame Counter 2" value="2"/>
      </value-group>
      <value-group name="SLCD_BCFG__MODE">
        <value name="BLINKALL" caption="Blink all segments" value="0"/>
        <value name="BLINKSEL" caption="Blink selected segments" value="1"/>
      </value-group>
      <value-group name="SLCD_CSRCFG__FCS">
        <value name="FC0" caption="Frame Counter 0" value="0"/>
        <value name="FC1" caption="Frame Counter 1" value="1"/>
        <value name="FC2" caption="Frame Counter 2" value="2"/>
      </value-group>
      <value-group name="SLCD_ACMCFG__FCS">
        <value name="FC0" caption="Frame Counter 0" value="0"/>
        <value name="FC1" caption="Frame Counter 1" value="1"/>
        <value name="FC2" caption="Frame Counter 2" value="2"/>
      </value-group>
      <value-group name="SLCD_ACMCFG__MODE">
        <value name="SEQ" caption="Sequential Display Mode" value="0"/>
        <value name="SCROLL" caption="Scrolling Display Mode" value="1"/>
      </value-group>
      <value-group name="SLCD_ABMCFG__FCS">
        <value name="FC0" caption="Frame Counter 0" value="0"/>
        <value name="FC1" caption="Frame Counter 1" value="1"/>
        <value name="FC2" caption="Frame Counter 2" value="2"/>
      </value-group>
    </module>
    <module name="SUPC" id="U2117" version="3.0.0" caption="Supply Controller">
      <register-group name="SUPC" caption="Supply Controller">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="BOD12RDY" caption="BOD12 Ready" mask="0x8"/>
          <bitfield name="BOD12DET" caption="BOD12 Detection" mask="0x10"/>
          <bitfield name="B12SRDY" caption="BOD12 Synchronization Ready" mask="0x20"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="APWSRDY" caption="Automatic Power Switch Ready" mask="0x200"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="BOD12RDY" caption="BOD12 Ready" mask="0x8"/>
          <bitfield name="BOD12DET" caption="BOD12 Detection" mask="0x10"/>
          <bitfield name="B12SRDY" caption="BOD12 Synchronization Ready" mask="0x20"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="APWSRDY" caption="Automatic Power Switch Ready" mask="0x200"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="BOD12RDY" caption="BOD12 Ready" mask="0x8"/>
          <bitfield name="BOD12DET" caption="BOD12 Detection" mask="0x10"/>
          <bitfield name="B12SRDY" caption="BOD12 Synchronization Ready" mask="0x20"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="APWSRDY" caption="Automatic Power Switch Ready" mask="0x200"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
        </register>
