Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.0.20/atdf/ATSAML22N18A.atdf
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="BOD12RDY" caption="BOD12 Ready" mask="0x8"/>
          <bitfield name="BOD12DET" caption="BOD12 Detection" mask="0x10"/>
          <bitfield name="B12SRDY" caption="BOD12 Synchronization Ready" mask="0x20"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="APWSRDY" caption="Automatic Power Switch Ready" mask="0x200"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
          <bitfield name="BBPS" caption="Battery Backup Power Switch" mask="0x800"/>
        </register>
        <register name="BOD33" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BOD33 Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18" values="SUPC_BOD33__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="RUNBKUP" caption="Configuration in Backup mode" mask="0x80"/>
          <bitfield name="ACTCFG" caption="Configuration in Active mode" mask="0x100"/>
          <bitfield name="VMON" caption="Voltage Monitored in active and standby mode" mask="0x400"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SUPC_BOD33__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level for VDD" mask="0x3F0000"/>
          <bitfield name="BKUPLEVEL" caption="Threshold Level in backup sleep mode or for VBAT" mask="0x3F000000"/>
        </register>
        <register name="BOD12" offset="0x14" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BOD12 Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18" values="SUPC_BOD12__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="Configuration in Active mode" mask="0x100"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SUPC_BOD12__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level" mask="0x3F0000"/>
        </register>
        <register name="VREG" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="VREG Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="SEL" caption="Voltage Regulator Selection in active mode" mask="0xC" values="SUPC_VREG__SEL"/>
          <bitfield name="STDBYPL0" caption="Standby in PL0" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="LPEFF" caption="Low Power efficiency" mask="0x100"/>
          <bitfield name="VSVSTEP" caption="Voltage Scaling Voltage Step" mask="0xF0000"/>
          <bitfield name="VSPER" caption="Voltage Scaling Period" mask="0xFF000000"/>
        </register>
        <register name="VREF" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VREF Control">
          <bitfield name="VREFOE" caption="Voltage Reference Output Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Contrl" mask="0x80"/>
          <bitfield name="SEL" caption="Voltage Reference Selection" mask="0xF0000" values="SUPC_VREF__SEL"/>
        </register>
        <register name="BBPS" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Battery Backup Power Switch">
          <bitfield name="CONF" caption="Battery Backup Configuration" mask="0x3" values="SUPC_BBPS__CONF"/>
          <bitfield name="WAKEEN" caption="Wake Enable" mask="0x4"/>
          <bitfield name="PSOKEN" caption="Power Supply OK Enable" mask="0x8"/>
        </register>
        <register name="BKOUT" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Backup Output Control">
          <bitfield name="EN" caption="Enable Output" mask="0x3"/>
          <bitfield name="CLR" caption="Clear Output" mask="0x300"/>
          <bitfield name="SET" caption="Set Output" mask="0x30000"/>
          <bitfield name="RTCTGL" caption="RTC Toggle Output" mask="0x3000000"/>
        </register>
        <register name="BKIN" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Backup Input Control">
          <bitfield name="BKIN" caption="Backup Input Value" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="SUPC_BOD33__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INT" caption="The BOD33 generates an interrupt" value="0x2"/>
        <value name="BKUP" caption="The BOD33 puts the device in backup sleep mode if VMON=0" value="0x3"/>
      </value-group>
      <value-group name="SUPC_BOD33__PSEL">
        <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
        <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
        <value name="DIV1024" caption="Divide clock by 1024" value="0x9"/>
        <value name="DIV2048" caption="Divide clock by 2048" value="0xA"/>
        <value name="DIV4096" caption="Divide clock by 4096" value="0xB"/>
        <value name="DIV8192" caption="Divide clock by 8192" value="0xC"/>
        <value name="DIV16384" caption="Divide clock by 16384" value="0xD"/>
        <value name="DIV32768" caption="Divide clock by 32768" value="0xE"/>
        <value name="DIV65536" caption="Divide clock by 65536" value="0xF"/>
      </value-group>
